markluo0311/nrf52832_bt_mesh/mesh/src/dfu/nrf_mesh_dfu.c
/* Copyright (c) 2010 - 2017, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <string.h>
#include "nrf.h"
#include "nrf_mesh_dfu.h"
#include "timeslot.h"
#include "nrf_mesh_dfu_types.h"
#include "dfu_types_internal.h"
#include "toolchain.h"
#include "event.h"
#include "bl_if.h"
#include "nrf_flash.h"
#include "timer_scheduler.h"
#include "mesh_flash.h"
#include "rand.h"
#include "nrf_mesh_assert.h"
#include "bearer_adv.h"
#include "log.h"
#include "hal.h"

/** Check that the enums used for DFU enums for TYPE, STATE, END, and ROLE fit the assumptions */
NRF_MESH_STATIC_ASSERT(NRF_MESH_DFU_TYPE__LAST      <= UINT8_MAX);
NRF_MESH_STATIC_ASSERT(NRF_MESH_DFU_STATE__LAST     <= UINT8_MAX);
NRF_MESH_STATIC_ASSERT(NRF_MESH_DFU_END_ERROR__LAST <= UINT8_MAX);
NRF_MESH_STATIC_ASSERT(NRF_MESH_DFU_ROLE__LAST      <= UINT8_MAX);

/*****************************************************************************
* Local defines
*****************************************************************************/
#define MAX_NUMBER_INTERRUPTS           (32)        /**< Maximum number of interrupts available. */

#define DFU_TX_REDUNCANCY_MAX           (2)         /**< Max number of observed retransmits before a transmit is regarded redundant. */
#define DFU_TX_INTERVAL_EXPONENTIAL_US  (100000)    /**< Time between the first two transmits in exponential packets. */
#define DFU_TX_INTERVAL_REGULAR_US      (100000)    /**< Time between transmits for fast regular transmits. */
#define DFU_TX_INTERVAL_REGULAR_SLOW_US (10000000)  /**< Time between transmits for slow regular transmits. */
#define DFU_TX_START_DELAY_MASK_US      (0xFFFF)    /**< Must be power of two. */
#define DFU_TX_TIMER_MARGIN_US          (1000)      /**< Time margin for a timeout to be considered instant. */
#define DFU_CHANNEL_MAP                 ((1 << 0) | (1 << 1) | (1 << 2)) /**< Channel map to transmit on (starting at 37). */

#define TIMER_START_TIMEOUT_US          (50000000)  /**< Time to wait for first data during a transfer. */
#define TIMER_DATA_TIMEOUT_US           (10000000)  /**< Time to wait for next data during a transfer. */
/*****************************************************************************
* Local typedefs
*****************************************************************************/

/** DFU TX slot. The DFU can interleave multiple periodic transmits, and each
 * periodic transmit gets its own slot. */
typedef struct
{
    uint32_t order_time;                    /**< Timestamp when the packet was first ordered. */
    bl_radio_interval_type_t interval_type; /**< Type of interval for this periodic transmit. */
    nrf_mesh_dfu_packet_t dfu_packet;       /**< DFU packet being sent on this slot. */
    uint8_t dfu_packet_len;                 /**< Length of the DFU packet. */
    uint8_t repeats;                        /**< Number of repeats this transmit should do. */
    uint8_t tx_count;                       /**< Number of repeats so far. */
    /** Number of times this packet has been received since the previous
     * transmit. To reduce the traffic on air, a transmit might be skipped if
     * the packet is received @ref DFU_TX_REDUNCANCY_MAX times since the
     * previous transmit. */
    uint8_t rx_count;
} dfu_tx_t;

/** Internal transfer state structure */
typedef struct
{
    nrf_mesh_dfu_role_t  role;           /**< This device's intended role in the transfer. */
    nrf_mesh_dfu_type_t  type;           /**< The DFU type of the transfer. */
    nrf_mesh_fwid_t      fwid;           /**< The FWID of the new data in the transfer. */
    nrf_mesh_dfu_state_t state;          /**< The current global state of the transfer. */
    uint16_t             segment_count;  /**< Number of segments received in current transfer. */
    uint16_t             total_segments; /**< Number of segments required for the entire transfer. */
} dfu_transfer_state_internal_t;

/*****************************************************************************
* Static globals
*****************************************************************************/
bl_if_cmd_handler_t                  m_cmd_handler;            /**< Command handler in shared code space, non-static for unit testing purposes. */
static timer_event_t                 m_timer_evt;              /**< Timer event for scheduler. */
static timer_event_t                 m_tx_timer_evt;           /**< TX event for scheduler. */
static dfu_tx_t                      m_tx_slots[NRF_MESH_DFU_TX_SLOTS]; /**< TX slots for concurrent transmits. */
static prng_t                        m_prng;                   /**< PRNG for time delays. */
static fwid_t*                       mp_curr_fwid;             /**< Current Firmware IDs. */
static dfu_transfer_state_internal_t m_transfer_state;         /**< State of the ongoing transfer. */
/*****************************************************************************
* Static functions
*****************************************************************************/
static void reset_transfer_state(void)
{
    timer_sch_abort(&m_timer_evt);
    m_transfer_state.role = NRF_MESH_DFU_ROLE_NONE;
    m_transfer_state.segment_count = 0;
    m_transfer_state.total_segments = 0;
    m_transfer_state.type = NRF_MESH_DFU_TYPE_INVALID;
    m_transfer_state.state = NRF_MESH_DFU_STATE_INITIALIZED;
}

static void end_transfer(nrf_mesh_dfu_end_t end_reason)
{
    nrf_mesh_evt_t evt;
    evt.type = NRF_MESH_EVT_DFU_END;
    evt.params.dfu.end.transfer.dfu_type = m_transfer_state.type;
    evt.params.dfu.end.transfer.id = m_transfer_state.fwid;
    evt.params.dfu.end.role = m_transfer_state.role;
    evt.params.dfu.end.end_reason = end_reason;
    reset_transfer_state();
    event_handle(&evt);
}

static inline bool tx_slot_in_use(dfu_tx_t* p_tx)
{
    return (p_tx->repeats != 0);
}

static uint32_t get_curr_fwid(nrf_mesh_dfu_type_t type, nrf_mesh_fwid_t* p_fwid)
{
    switch (type)
    {
        case NRF_MESH_DFU_TYPE_SOFTDEVICE:
            p_fwid->softdevice = mp_curr_fwid->sd;
            break;
        case NRF_MESH_DFU_TYPE_BOOTLOADER:
            p_fwid->bootloader = mp_curr_fwid->bootloader;
            break;
        case NRF_MESH_DFU_TYPE_APPLICATION:
            p_fwid->application = mp_curr_fwid->app;
            break;
        default:
            return NRF_ERROR_NOT_SUPPORTED;
    }
    return NRF_SUCCESS;
}

static uint32_t next_tx_timeout(dfu_tx_t* p_tx)
{
    switch (p_tx->interval_type)
    {
        case BL_RADIO_INTERVAL_TYPE_EXPONENTIAL:
            return (p_tx->order_time + DFU_TX_INTERVAL_EXPONENTIAL_US * ((1 << (p_tx->tx_count)) - 1));
        case BL_RADIO_INTERVAL_TYPE_REGULAR:
            return (p_tx->order_time + DFU_TX_INTERVAL_REGULAR_US * p_tx->tx_count);
        case BL_RADIO_INTERVAL_TYPE_REGULAR_SLOW:
            return (p_tx->order_time + DFU_TX_INTERVAL_REGULAR_SLOW_US * p_tx->tx_count);
        default:
            /* Unknown type */
            NRF_MESH_ASSERT(false);
            return 0;
    }
}

