markluo0311/nrf52832_bt_mesh/mesh/src/dfu/nrf_mesh_dfu.c
static void tx_end_handle(dfu_tx_t* p_tx, timestamp_t prev_timeout)
{
    if (p_tx->tx_count == BL_IF_TX_REPEATS_INF &&
        p_tx->repeats  == BL_IF_TX_REPEATS_INF)
    {
        p_tx->order_time = prev_timeout;
        p_tx->tx_count = 0;
    }
    else if (p_tx->tx_count >= p_tx->repeats)
    {
        p_tx->repeats = 0;
    }
}

static void interrupts_disable(void)
{
#if !HOST
    uint32_t interrupt_setting_mask = NVIC->ISER[0];

    /* Loop through and disable all interrupts. */
    for (uint32_t irq = 0; irq < MAX_NUMBER_INTERRUPTS; irq++)
    {
        if (interrupt_setting_mask & (1UL << irq))
        {
            NVIC_DisableIRQ((IRQn_Type) irq);
        }
    }
#endif
}

static void build_dfu_packet(packet_t* p_packet, nrf_mesh_dfu_packet_t* p_dfu_packet, uint32_t dfu_packet_length)
{
    ble_gap_addr_t adv_addr;
    (void) bearer_adv_addr_get(&adv_addr);
    memcpy(p_packet->addr, adv_addr.addr, BLE_GAP_ADDR_LEN);
    ble_ad_data_t* p_ad = (ble_ad_data_t*) &p_packet->payload[0];
    ble_ad_data_service_data_t* p_service_data = (ble_ad_data_service_data_t*) &p_ad->data[0];

    p_packet->header.type   = BLE_PACKET_TYPE_ADV_NONCONN_IND;
    p_packet->header.length = dfu_packet_length + DFU_PACKET_OVERHEAD;
    p_ad->length            = DFU_PACKET_PAYLOAD_OVERHEAD + dfu_packet_length;
    p_ad->type              = AD_TYPE_DFU;
    p_service_data->uuid    = BLE_ADV_SERVICE_DATA_UUID_DFU;
    memcpy(&p_service_data->data[0],
            p_dfu_packet,
            dfu_packet_length);
}

static void tx_timeout(uint32_t timestamp, void* p_context)
{
    uint32_t next_timeout = timestamp + (UINT32_MAX / 2);
    for (uint32_t i = 0; i < NRF_MESH_DFU_TX_SLOTS; ++i)
    {
        if (tx_slot_in_use(&m_tx_slots[i]))
        {
            uint32_t timeout = next_tx_timeout(&m_tx_slots[i]);
            if (TIMER_OLDER_THAN(timeout, (timestamp + DFU_TX_TIMER_MARGIN_US)))
            {
                if (m_tx_slots[i].rx_count >= DFU_TX_REDUNCANCY_MAX &&
                    m_tx_slots[i].tx_count < m_tx_slots[i].repeats)
                {
                    /* We've seen this handle on air multiple times, skip this transmit. */
                    m_tx_slots[i].tx_count++;
                }
                else
                {
                    uint8_t chmap = DFU_CHANNEL_MAP;
                    packet_t* p_packet;
                    uint32_t status_code = packet_mgr_alloc((packet_generic_t**) &p_packet,
                        m_tx_slots[i].dfu_packet_len + DFU_PACKET_OVERHEAD + BLE_ADV_PACKET_HEADER_LENGTH);
                    if (status_code == NRF_SUCCESS)
                    {
                        build_dfu_packet(p_packet, &m_tx_slots[i].dfu_packet, m_tx_slots[i].dfu_packet_len);

                        if (bearer_adv_tx_raw(p_packet, &chmap) == NRF_SUCCESS)
                        {
                            if (m_tx_slots[i].tx_count < m_tx_slots[i].repeats)
                            {
                                m_tx_slots[i].tx_count++;
                            }
                        }
                        else
                        {
                            packet_mgr_free(p_packet);
                        }
                    }
                }
                m_tx_slots[i].rx_count = 0;
                tx_end_handle(&m_tx_slots[i], timeout);
                timeout = next_tx_timeout(&m_tx_slots[i]);
            }
            if (tx_slot_in_use(&m_tx_slots[i]) && TIMER_DIFF(timeout, timestamp) < TIMER_DIFF(next_timeout, timestamp))
            {
                next_timeout = timeout;
            }
        }
    }
    timer_sch_reschedule(&m_tx_timer_evt, next_timeout);
}

static void abort_timeout(uint32_t timestamp, void* p_context)
{
    __LOG(LOG_SRC_DFU, LOG_LEVEL_INFO, "ABORT Timeout fired @%d\n", timestamp);
    bl_cmd_t abort_cmd;
    abort_cmd.type = BL_CMD_TYPE_DFU_ABORT;
    if (nrf_mesh_dfu_cmd_send(&abort_cmd) == NRF_SUCCESS)
    {
        end_transfer(NRF_MESH_DFU_END_ERROR_TIMEOUT);
    }
}

static void timer_timeout(uint32_t timestamp, void* p_context)
{
    __LOG(LOG_SRC_DFU, LOG_LEVEL_INFO, "Timeout fired @%d\n", timestamp);
    bl_cmd_t timeout_cmd;
    timeout_cmd.type = BL_CMD_TYPE_TIMEOUT;
    timeout_cmd.params.timeout.timer_index = 0;
    (void) nrf_mesh_dfu_cmd_send(&timeout_cmd);
}

static void flash_op_complete(mesh_flash_user_t user, const flash_operation_t * p_op, uint16_t token)
{
    NRF_MESH_ASSERT(user == MESH_FLASH_USER_DFU);
    bl_cmd_t end_cmd;
    switch (p_op->type)
    {
        case FLASH_OP_TYPE_WRITE:
            end_cmd.type = BL_CMD_TYPE_FLASH_WRITE_COMPLETE;
            end_cmd.params.flash.write.p_data = p_op->params.write.p_data;
            __LOG(LOG_SRC_DFU, LOG_LEVEL_INFO, "Write complete (0x%x)\n", p_op->params.write.p_data);
            break;
        case FLASH_OP_TYPE_ERASE:
            end_cmd.type = BL_CMD_TYPE_FLASH_ERASE_COMPLETE;
            end_cmd.params.flash.erase.p_dest = p_op->params.erase.p_start_addr;
            __LOG(LOG_SRC_DFU, LOG_LEVEL_INFO, "Erase complete (0x%x)\n", p_op->params.erase.p_start_addr);
            break;
        case FLASH_OP_TYPE_ALL:
            end_cmd.type = BL_CMD_TYPE_FLASH_ALL_COMPLETE;
            __LOG(LOG_SRC_DFU, LOG_LEVEL_INFO, "Flash idle.\n");
            break;
        default:
            NRF_MESH_ERROR_CHECK(NRF_ERROR_INVALID_PARAM);
    }

    (void) nrf_mesh_dfu_cmd_send(&end_cmd); /* don't care about the return code */
}

/**
 * Go through the TX slots and bump the redundancy counter on any packet
 * matching the given packet.
 */
static void tx_packet_redundancy_check(const nrf_mesh_dfu_packet_t* p_packet, uint32_t length)
{
    if (p_packet->packet_type == DFU_PACKET_TYPE_DATA &&
        p_packet->payload.data.segment > 0)
    {
        for (uint32_t i = 0; i < NRF_MESH_DFU_TX_SLOTS; ++i)
        {
            if (tx_slot_in_use(&m_tx_slots[i]))
            {
                /* Check for packet match */

                if (m_tx_slots[i].dfu_packet.packet_type                 == DFU_PACKET_TYPE_DATA &&
                    m_tx_slots[i].dfu_packet.payload.data.segment        == p_packet->payload.data.segment &&
                    m_tx_slots[i].dfu_packet.payload.data.transaction_id == p_packet->payload.data.transaction_id &&
                    m_tx_slots[i].rx_count < (1 << (8 * sizeof(m_tx_slots[i].rx_count))) - 1) /* Check that we're not about to wrap around */
                {
                    uint32_t was_masked;
                    _DISABLE_IRQS(was_masked);
                    m_tx_slots[i].rx_count++;
                    _ENABLE_IRQS(was_masked);
                    break;
                }
            }
        }
    }
}

