markluo0311/nrf52832_bt_mesh/mesh/src/dfu/nrf_mesh_dfu.c
static uint32_t dfu_evt_handler(bl_evt_t* p_evt)
{
    uint32_t return_code = NRF_SUCCESS;
    switch (p_evt->type)
    {
        case BL_EVT_TYPE_ECHO:
            __LOG(LOG_SRC_DFU, LOG_LEVEL_INFO, "\tEcho: %s\n", p_evt->params.echo.str);
            break;
        case BL_EVT_TYPE_DFU_ABORT:
            {
                __LOG(LOG_SRC_DFU, LOG_LEVEL_INFO, "\tAbort event. Reason: 0x%x\n", p_evt->params.dfu.abort.reason);
                end_transfer(p_evt->params.dfu.abort.reason);
            }
            break;

        case BL_EVT_TYPE_DFU_NEW_FW:
            {
                __LOG(LOG_SRC_DFU, LOG_LEVEL_INFO, "\tNew firmware!\n");
                nrf_mesh_evt_t evt;
                evt.type = NRF_MESH_EVT_DFU_FIRMWARE_OUTDATED_NO_AUTH;
                evt.params.dfu.fw_outdated.transfer.dfu_type = p_evt->params.dfu.new_fw.fw_type;
                evt.params.dfu.fw_outdated.transfer.id       = p_evt->params.dfu.new_fw.fwid;
                if (get_curr_fwid(
                            p_evt->params.dfu.new_fw.fw_type,
                            &evt.params.dfu.fw_outdated.current) == NRF_SUCCESS)
                {
                    event_handle(&evt);
                }
            }
            break;

        case BL_EVT_TYPE_DFU_REQ:
            {
                __LOG(LOG_SRC_DFU, LOG_LEVEL_INFO, "\tSource/relay request!\n");
                /* Forward to application */
                nrf_mesh_evt_t evt;
                switch (p_evt->params.dfu.req.role)
                {
                    case NRF_MESH_DFU_ROLE_RELAY:
                        evt.type = NRF_MESH_EVT_DFU_REQ_RELAY;
                        evt.params.dfu.req_relay.transfer.dfu_type = p_evt->params.dfu.req.dfu_type;
                        evt.params.dfu.req_relay.transfer.id = p_evt->params.dfu.req.fwid;
                        evt.params.dfu.req_relay.authority = p_evt->params.dfu.req.authority;
                        break;
                    case NRF_MESH_DFU_ROLE_SOURCE:
                        evt.type = NRF_MESH_EVT_DFU_REQ_SOURCE;
                        evt.params.dfu.req_source.dfu_type = p_evt->params.dfu.req.dfu_type;
                        break;
                    default:
                        return NRF_ERROR_NOT_SUPPORTED;
                }
                event_handle(&evt);
            }
            break;

        case BL_EVT_TYPE_DFU_START:
            {
                __LOG(LOG_SRC_DFU, LOG_LEVEL_INFO, "\tDFU start\n");
                if (p_evt->params.dfu.start.role == NRF_MESH_DFU_ROLE_TARGET)
                {
                    m_transfer_state.state = NRF_MESH_DFU_STATE_TARGET;
                }
                else
                {
                    m_transfer_state.state = NRF_MESH_DFU_STATE_RELAY;
                }
                m_transfer_state.segment_count = 0;
                m_transfer_state.role = p_evt->params.dfu.start.role;
                m_transfer_state.fwid = p_evt->params.dfu.start.fwid;
                nrf_mesh_evt_t evt;
                evt.type = NRF_MESH_EVT_DFU_START;
                evt.params.dfu.start.transfer.dfu_type = p_evt->params.dfu.start.dfu_type;
                evt.params.dfu.start.transfer.id = p_evt->params.dfu.start.fwid;
                evt.params.dfu.start.role = p_evt->params.dfu.start.role;
                event_handle(&evt);
                m_timer_evt.cb = abort_timeout;
                timer_sch_reschedule(&m_timer_evt, timer_now() + TIMER_START_TIMEOUT_US);
            }
            break;

        case BL_EVT_TYPE_DFU_DATA_SEGMENT_RX:
            m_transfer_state.segment_count++;
            m_transfer_state.total_segments = p_evt->params.dfu.data_segment.total_segments;
            m_timer_evt.cb = abort_timeout;
            timer_sch_reschedule(&m_timer_evt, timer_now() + TIMER_DATA_TIMEOUT_US);
            break;

        case BL_EVT_TYPE_DFU_END:
            {
                __LOG(LOG_SRC_DFU, LOG_LEVEL_INFO, "\tDFU END!\n");
                end_transfer(NRF_MESH_DFU_END_SUCCESS);
            }
            break;

        case BL_EVT_TYPE_BANK_AVAILABLE:
            {
                __LOG(LOG_SRC_DFU, LOG_LEVEL_INFO, "\tDFU BANK AVAILABLE\n");
                nrf_mesh_evt_t evt;
                evt.type = NRF_MESH_EVT_DFU_BANK_AVAILABLE;
                evt.params.dfu.bank.transfer.dfu_type   = p_evt->params.bank_available.bank_dfu_type;
                evt.params.dfu.bank.transfer.id         = p_evt->params.bank_available.bank_fwid;
                evt.params.dfu.bank.p_start_addr        = p_evt->params.bank_available.p_bank_addr;
                evt.params.dfu.bank.length              = p_evt->params.bank_available.bank_length;
                evt.params.dfu.bank.is_signed           = p_evt->params.bank_available.is_signed;
                event_handle(&evt);
            }
            break;

        case BL_EVT_TYPE_FLASH_ERASE:
            {
                if (!IS_PAGE_ALIGNED(p_evt->params.flash.erase.start_addr))
                {
                    return_code = NRF_ERROR_INVALID_ADDR;
                }
                else
                {
                    flash_operation_t flash_op;
                    flash_op.type = FLASH_OP_TYPE_ERASE;
                    flash_op.params.erase.p_start_addr = (uint32_t *) p_evt->params.flash.erase.start_addr;
                    flash_op.params.erase.length = p_evt->params.flash.erase.length;
                    return_code = mesh_flash_op_push(MESH_FLASH_USER_DFU, &flash_op, NULL);
                }
            }
            break;

        case BL_EVT_TYPE_FLASH_WRITE:
            {
                if (!IS_WORD_ALIGNED(p_evt->params.flash.write.start_addr) ||
                    !IS_WORD_ALIGNED(p_evt->params.flash.write.p_data))
                {
                    return_code = NRF_ERROR_INVALID_ADDR;
                }
                else if (!IS_WORD_ALIGNED(p_evt->params.flash.write.length))
                {
                    return_code = NRF_ERROR_INVALID_LENGTH;
                }
                else
                {
                    flash_operation_t flash_op;
                    flash_op.type = FLASH_OP_TYPE_WRITE;
                    flash_op.params.write.p_start_addr = (uint32_t *) p_evt->params.flash.write.start_addr;
                    flash_op.params.write.p_data = (uint32_t *) p_evt->params.flash.write.p_data;
                    flash_op.params.write.length = p_evt->params.flash.write.length;
                    return_code = mesh_flash_op_push(MESH_FLASH_USER_DFU, &flash_op, NULL);
                }
            }
            break;

        case BL_EVT_TYPE_TX_RADIO:
            {
                __LOG(LOG_SRC_DFU, LOG_LEVEL_INFO, "\tRADIO TX! SLOT %d, count %d, interval: %s, handle: %x\n",
                        p_evt->params.tx.radio.tx_slot,
                        p_evt->params.tx.radio.tx_count,
                        p_evt->params.tx.radio.interval_type == BL_RADIO_INTERVAL_TYPE_EXPONENTIAL ? "exponential" : "periodic",
                        p_evt->params.tx.radio.p_dfu_packet->packet_type
                     );

                dfu_tx_t* p_tx_slot = &m_tx_slots[p_evt->params.tx.radio.tx_slot];

                if (tx_slot_in_use(p_tx_slot))
                {
                    __LOG(LOG_SRC_DFU, LOG_LEVEL_WARN, "Killing a TX slot prematurely (repeats done: %u).\n", p_tx_slot->tx_count);
                }
                /* Disable the slot */
                p_tx_slot->repeats = 0;

                uint32_t time_now = timer_now();

                /* Fill the TX slot. */
                p_tx_slot->interval_type = p_evt->params.tx.radio.interval_type;
                p_tx_slot->tx_count = 0;
                p_tx_slot->rx_count = 0;
                p_tx_slot->order_time = time_now + DFU_TX_TIMER_MARGIN_US + (rand_prng_get(&m_prng) & (DFU_TX_START_DELAY_MASK_US));
                p_tx_slot->dfu_packet_len = p_evt->params.tx.radio.length;
                memcpy(&p_tx_slot->dfu_packet, p_evt->params.tx.radio.p_dfu_packet, p_evt->params.tx.radio.length);

                p_tx_slot->repeats = p_evt->params.tx.radio.tx_count;

                /* Fire away */
                if (TIMER_DIFF(p_tx_slot->order_time, time_now) < TIMER_DIFF(m_tx_timer_evt.timestamp, time_now))
                {
                    timer_sch_reschedule(&m_tx_timer_evt,
                            p_tx_slot->order_time);
                }
            }
            break;

        case BL_EVT_TYPE_TX_SERIAL:
            __LOG(LOG_SRC_DFU, LOG_LEVEL_INFO, "\tSERIAL TX!\n");
            break;

        case BL_EVT_TYPE_TX_ABORT:
            if (p_evt->params.tx.abort.tx_slot >= NRF_MESH_DFU_TX_SLOTS)
            {
                return_code = NRF_ERROR_INVALID_PARAM;
            }
            else if (!tx_slot_in_use(&m_tx_slots[p_evt->params.tx.abort.tx_slot]))
            {
                return_code = NRF_ERROR_INVALID_STATE;
            }
            else
            {
                m_tx_slots[p_evt->params.tx.abort.tx_slot].repeats = 0;
            }
            break;

        case BL_EVT_TYPE_TIMER_SET:
            {
                m_timer_evt.cb = timer_timeout;
                timestamp_t set_time = timer_now() + p_evt->params.timer.set.delay_us;
                timer_sch_reschedule(&m_timer_evt, set_time);
                __LOG(LOG_SRC_DFU, LOG_LEVEL_INFO, "\tTIMER set: %uus delay (@%u)\n", p_evt->params.timer.set.delay_us, set_time);
            }
            break;

        case BL_EVT_TYPE_TIMER_ABORT:
            __LOG(LOG_SRC_DFU, LOG_LEVEL_INFO, "\tTIMER abort: %d\n", p_evt->params.timer.abort.index);
            timer_sch_abort(&m_timer_evt);
            break;

        case BL_EVT_TYPE_ERROR:
            __LOG(LOG_SRC_DFU, LOG_LEVEL_ERROR, "\tBL ERROR: %x @%s:L%u\n",
                    p_evt->params.error.error_code,
                    p_evt->params.error.p_file,
                    p_evt->params.error.line);
            NRF_MESH_ASSERT(false);
            break;
        default:
            __LOG(LOG_SRC_DFU, LOG_LEVEL_WARN, "\tUNSUPPORTED EVENT\n");
            return_code = NRF_ERROR_NOT_SUPPORTED;
            break;
    }
    return return_code;
}

