markluo0311/nrf52832_bt_mesh/mesh/src/dfu/nrf_mesh_dfu.c
#if !HOST
static uint32_t dfu_cmd_handler_set(bl_if_cmd_handler_t handler)
{
    if (handler == NULL)
    {
        return NRF_ERROR_NULL;
    }
    if (BOOTLOADERADDR() == 0xFFFFFFFF)
    {
        /* No bootloader present. */
        return NRF_ERROR_NOT_SUPPORTED;
    }
    if (((uint32_t) handler >= DEVICE_FLASH_END_GET()) ||
        ((uint32_t) handler < BOOTLOADERADDR()))
    {
        /* out of bounds. */
        return NRF_ERROR_INVALID_ADDR;
    }
    m_cmd_handler = handler;
    return NRF_SUCCESS;
}
#endif

/*****************************************************************************
* Interface functions
*****************************************************************************/

uint32_t nrf_mesh_dfu_init(void)
{
    uint32_t error_code;
#if  !HOST
    error_code = dfu_cmd_handler_set(*((bl_if_cmd_handler_t*) (DEVICE_DATA_RAM_END_GET() - sizeof(bl_if_cmd_handler_t))));
    if (error_code != NRF_SUCCESS)
    {
        m_transfer_state.state = NRF_MESH_DFU_STATE_INITIALIZED;
        return NRF_ERROR_NOT_SUPPORTED;
    }
#else
    /* Must have been set externally */
    NRF_MESH_ASSERT(m_cmd_handler != NULL);
#endif

    rand_prng_seed(&m_prng);

    m_timer_evt.cb           = timer_timeout;
    m_timer_evt.interval     = 0;
    m_timer_evt.p_context    = NULL;
    m_timer_evt.p_next       = NULL;
    m_tx_timer_evt.cb        = tx_timeout;
    m_tx_timer_evt.interval  = 0;
    m_tx_timer_evt.p_context = NULL;
    m_tx_timer_evt.p_next    = NULL;

    bl_cmd_t init_cmd =
    {
        .type = BL_CMD_TYPE_INIT,
        .params.init.bl_if_version = BL_IF_VERSION,
        .params.init.event_callback = dfu_evt_handler,
        .params.init.timer_count = 1,
        .params.init.tx_slots = NRF_MESH_DFU_TX_SLOTS,
        .params.init.in_app = true
    };

    error_code = nrf_mesh_dfu_cmd_send(&init_cmd);

    if (error_code != NRF_SUCCESS)
    {
        m_transfer_state.state = NRF_MESH_DFU_STATE_INITIALIZED;
        return error_code;
    }

    bl_cmd_t fwid_cmd;
    fwid_cmd.type = BL_CMD_TYPE_INFO_GET;
    fwid_cmd.params.info.get.type = BL_INFO_TYPE_VERSION;
    fwid_cmd.params.info.get.p_entry = NULL;
    error_code = nrf_mesh_dfu_cmd_send(&fwid_cmd);
    if (error_code != NRF_SUCCESS)
    {
        /* no version info */
        m_transfer_state.state = NRF_MESH_DFU_STATE_INITIALIZED;
        return error_code;
    }

    mp_curr_fwid = &fwid_cmd.params.info.get.p_entry->version;

    bl_cmd_t enable_cmd =
    {
        .type = BL_CMD_TYPE_ENABLE,
        .params = {{0}}
    };
    error_code = nrf_mesh_dfu_cmd_send(&enable_cmd);

    mesh_flash_user_callback_set(MESH_FLASH_USER_DFU, flash_op_complete);

    m_transfer_state.state = NRF_MESH_DFU_STATE_INITIALIZED;
    return error_code;
}

uint32_t nrf_mesh_dfu_jump_to_bootloader(void)
{
    if (BOOTLOADERADDR() != 0xFFFFFFFF)
    {
        interrupts_disable();
        hal_device_reset(BL_GPREGRET_FORCED_REBOOT);
        return NRF_SUCCESS; /* unreachable */
    }
    else
    {
        /* the BOOTLOADERADDR() isn't set, and we have no way to find the bootloader-address. */
        return NRF_ERROR_FORBIDDEN;
    }
}

uint32_t nrf_mesh_dfu_rx(nrf_mesh_dfu_packet_t* p_packet, uint32_t length)
{
    if (m_transfer_state.state == NRF_MESH_DFU_STATE_UNINITIALIZED)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    if (p_packet == NULL)
    {
        return NRF_ERROR_NULL;
    }
    if (p_packet->packet_type < DFU_HANDLE_RANGE_START)
    {
        return NRF_ERROR_INVALID_ADDR;
    }

    if (mesh_flash_in_progress())
    {
        return NRF_ERROR_BUSY;
    }

    tx_packet_redundancy_check(p_packet, length);

    bl_cmd_t rx_cmd =
    {
        .type = BL_CMD_TYPE_RX,
        .params.rx.p_dfu_packet = p_packet,
        .params.rx.length = length
    };

    return nrf_mesh_dfu_cmd_send(&rx_cmd);
}

uint32_t nrf_mesh_dfu_request(nrf_mesh_dfu_type_t type,
        const nrf_mesh_fwid_t* p_fwid,
        uint32_t* p_bank_addr)
{
    if (m_transfer_state.state != NRF_MESH_DFU_STATE_INITIALIZED)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    if (p_fwid == NULL || p_bank_addr == NULL)
    {
        return NRF_ERROR_NULL;
    }
    bl_cmd_t cmd;
    cmd.type = BL_CMD_TYPE_DFU_START_TARGET;
    cmd.params.dfu.start.target.type = type;
    cmd.params.dfu.start.target.fwid = *p_fwid;
    cmd.params.dfu.start.target.p_bank_start = p_bank_addr;
    uint32_t error_code = nrf_mesh_dfu_cmd_send(&cmd);
    if (error_code == NRF_SUCCESS)
    {
        m_transfer_state.role = NRF_MESH_DFU_ROLE_TARGET;
        m_transfer_state.type = type;
        m_transfer_state.fwid = *p_fwid;
        m_transfer_state.state = NRF_MESH_DFU_STATE_DFU_REQ;
        m_transfer_state.segment_count = 0;
        m_transfer_state.total_segments = 0;
        m_timer_evt.cb = abort_timeout;
        timer_sch_reschedule(&m_tx_timer_evt, timer_now() + NRF_MESH_DFU_REQ_TIMEOUT_US);
    }
    return error_code;
}

uint32_t nrf_mesh_dfu_relay(nrf_mesh_dfu_type_t type,
        const nrf_mesh_fwid_t* p_fwid)
{
    if (m_transfer_state.state == NRF_MESH_DFU_STATE_UNINITIALIZED)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    if (p_fwid == NULL)
    {
        return NRF_ERROR_NULL;
    }
    bl_cmd_t cmd;
    cmd.type = BL_CMD_TYPE_DFU_START_RELAY;
    cmd.params.dfu.start.relay.type = type;
    cmd.params.dfu.start.relay.fwid = *p_fwid;
    cmd.params.dfu.start.relay.transaction_id = 0;
    uint32_t error_code = nrf_mesh_dfu_cmd_send(&cmd);
    if (error_code == NRF_SUCCESS)
    {
        m_transfer_state.role = NRF_MESH_DFU_ROLE_RELAY;
        m_transfer_state.type = type;
        m_transfer_state.fwid = *p_fwid;
        m_transfer_state.state = NRF_MESH_DFU_STATE_RELAY_CANDIDATE;
        m_transfer_state.segment_count = 0;
        m_transfer_state.total_segments = 0;
    }
    return error_code;
}

uint32_t nrf_mesh_dfu_abort(void)
{
    if (m_transfer_state.state == NRF_MESH_DFU_STATE_UNINITIALIZED)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    bl_cmd_t cmd;
    cmd.type = BL_CMD_TYPE_DFU_ABORT;
    uint32_t error_code = nrf_mesh_dfu_cmd_send(&cmd);
    if (error_code == NRF_SUCCESS)
    {
        reset_transfer_state();
    }
    return error_code;
}

uint32_t nrf_mesh_dfu_bank_info_get(nrf_mesh_dfu_type_t type, nrf_mesh_dfu_bank_info_t* p_bank_info)
{
    if (m_transfer_state.state == NRF_MESH_DFU_STATE_UNINITIALIZED)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    if (p_bank_info == NULL)
    {
        return NRF_ERROR_NULL;
    }
    bl_cmd_t cmd;
    cmd.type = BL_CMD_TYPE_DFU_BANK_INFO_GET;
    cmd.params.dfu.bank_info_get.bank_dfu_type = type;
    cmd.params.dfu.bank_info_get.p_bank_info = p_bank_info;
    return nrf_mesh_dfu_cmd_send(&cmd);
}

uint32_t nrf_mesh_dfu_bank_flash(nrf_mesh_dfu_type_t bank_type)
{
    if (m_transfer_state.state == NRF_MESH_DFU_STATE_UNINITIALIZED)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    bl_cmd_t cmd;
    cmd.type = BL_CMD_TYPE_DFU_BANK_FLASH;
    cmd.params.dfu.bank_flash.bank_dfu_type = bank_type;
    return nrf_mesh_dfu_cmd_send(&cmd);
}

uint32_t nrf_mesh_dfu_state_get(nrf_mesh_dfu_transfer_state_t* p_dfu_transfer_state)
{
    if (m_transfer_state.state == NRF_MESH_DFU_STATE_UNINITIALIZED)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    if (p_dfu_transfer_state == NULL)
    {
        return NRF_ERROR_NULL;
    }
    p_dfu_transfer_state->role  = m_transfer_state.role;
    p_dfu_transfer_state->type  = m_transfer_state.type;
    p_dfu_transfer_state->fwid  = m_transfer_state.fwid;
    p_dfu_transfer_state->state = m_transfer_state.state;
    p_dfu_transfer_state->data_progress = (uint8_t) (
            ((uint32_t) m_transfer_state.segment_count * 100) /
            ((uint32_t) m_transfer_state.total_segments));
    return NRF_SUCCESS;
}

uint32_t nrf_mesh_dfu_cmd_send(bl_cmd_t* p_cmd)
{
    if (m_cmd_handler == NULL)
    {
        __LOG(LOG_SRC_DFU, LOG_LEVEL_ERROR, "ERROR: No CMD handler!\n");
        return NRF_ERROR_NOT_SUPPORTED;
    }
    if (p_cmd == NULL)
    {
        return NRF_ERROR_NULL;
    }
    /* Suspend flash operations for the duration of the command to avoid
       premature flash-events disturbing the flow */
    mesh_flash_set_suspended(true);
    uint32_t error_code = m_cmd_handler(p_cmd);
    mesh_flash_set_suspended(false);
    return error_code;
}
